In [1]:
!pip install mysql-connector-python

Requirement already satisfied: mysql-connector-python in c:\users\it department\anaconda3\lib\site-packages (8.0.27)
Collecting protobuf>=3.0.0
  Downloading protobuf-3.19.1-cp39-cp39-win_amd64.whl (895 kB)
Installing collected packages: protobuf
Successfully installed protobuf-3.19.1

## Create Database Connection and get all available databases in system

In [13]:
import mysql.connector as connection

try:
    mydb = connection.connect(host = "localhost", user = "root", passwd = "Sachin@123", use_pure = True)
    #check if the connection is established
    
    query = "SHOW DATABASES"
    
    cursor = mydb.cursor() # create a cursor to execute queries
    cursor.execute(query)
    print(cursor.fetchall())
    
except Exception as e:
    mydb.close()
    print(str(e))

[('information_schema',), ('mysql',), ('performance_schema',), ('sakila',), ('sys',), ('world',)]

### Database Connection Step by Step

#### 1. Install MySql Connector Package from pip repository

In [2]:
!pip install mysql-connector-python

Requirement already satisfied: mysql-connector-python in c:\users\it department\anaconda3\lib\site-packages (8.0.27)
Requirement already satisfied: protobuf>=3.0.0 in c:\users\it department\anaconda3\lib\site-packages (from mysql-connector-python) (3.19.1)

#### 2. Import `mysql.connection` package which is required to use all the functions required to perform database related operation

In [14]:
import mysql.connector as connection

#### 3. Make connection from Jupyter notebook to mysql server

In [15]:
conn = connection.Connect(host = "localhost", user = "root", passwd = "Sachin@123", use_pure = True)

#### 4. Create `cursor()` which is nothing but pointer (iterable object) to point data inside database server

In [16]:
cur = conn.cursor()

#### 5. Execute query (query means what you want from database or to do with database) and get result where cursor will be pointing to fist location of the result data

In [17]:
cur.execute("show databases")

#### 6. Instruct cursor to fetch whatever data we have in result

In [18]:
res = cur.fetchall()

In [19]:
res

[('information_schema',),
 ('mysql',),
 ('performance_schema',),
 ('sakila',),
 ('sys',),
 ('world',)]

In [20]:
res[1]

('mysql',)

#### 7. Close connection once your workdone

In [21]:
conn.close()

In [22]:
conn.cursor()

OperationalError: MySQL Connection not available.

### Create new database

In [23]:
import mysql.connector as connection

try:
    conn = connection.connect(host = "localhost", user = "root", passwd = "Sachin@123", use_pure = True)
    #check if the connection is established
    
    query = "create database sach123"
    
    cursor = conn.cursor() # create a cursor to execute queries
    cursor.execute(query)
    
    
except Exception as e:
    conn.close()
    print(str(e))

In [24]:
conn = connection.connect(host = "localhost", user = "root", passwd = "Sachin@123", use_pure = True)
cur = conn.cursor()
query = "show databases"
cur.execute(query)
print(cur.fetchall())
conn.close()

[('information_schema',), ('mysql',), ('performance_schema',), ('sach123',), ('sakila',), ('sys',), ('world',)]

### Create table inside newly created database

In [25]:
import mysql.connector as connection

try:
    conn = connection.connect(host = "localhost", database = "sach123", user = "root", passwd = "Sachin@123", use_pure = True)
    #check if the connection is established
    print(conn.is_connected())
    
    query = "CREATE TABLE StudentDetails (Sid INT(10) AUTO_INCREMENT PRIMARY KEY, FirstName VARCHAR(60), LastName VARCHAR(60), RegistrationDate DATE, Class Varchar(20), Section Varchar(10))"
    
    cursor = conn.cursor() # create a cursor to execute queries
    cursor.execute(query)
    print("Table Created Successfully")
    conn.close()
    
except Exception as e:
    conn.close()
    print(str(e))

True
Table Created Successfully

In above code:
 - In connection code; addition to host, user & password we need to give name of the database. In above case `database = "sach123"`
 - In query; need to write query for creating database table `"CREATE TABLE tablename (col1 INT(10) AUTO_INCREMENT PRIMARY KEY, col2 VARCHAR(60), col3 DATE)"
    `

### Insert data into a table

In [32]:
import mysql.connector as connection

try:
    conn = connection.connect(host = "localhost", database = "sach123", user = "root", passwd = "Sachin@123")
    print(conn.is_connected())
    
    query = "INSERT INTO StudentDetails VALUES(101,'Sachin','Kumar', '1995-10-24', 'BE', 'IT')"
    
    cur = conn.cursor()
    cur.execute(query)
    conn.commit()
    conn.close()
    
except Exception as e:
    conn.close()
    print(str(e))

True

#### Add multiple record in database

In [33]:
import mysql.connector as connection
conn = connection.connect(host = "localhost", database = "sach123", user = "root", passwd = "Sachin@123")
cur = conn.cursor()

In [34]:
query = "INSERT INTO StudentDetails VALUES(102,'Nitin','Patil', '1993-12-15', 'TE', 'Comps')"
cur.execute(query)
conn.commit()

In [35]:
query = "INSERT INTO StudentDetails VALUES(103,'Harshal','Singh', '1994-06-18', 'SE', 'EXTC')"
cur.execute(query)

In [36]:
query = "INSERT INTO StudentDetails VALUES(104,'Pooja','Sinha', '1993-08-19', 'FE', 'Civil')"
cur.execute(query)

In [37]:
conn.commit()

In [38]:
conn.close()

### Extract data from Database Table

In [13]:
import mysql.connector as connection
conn = connection.connect(host = "localhost", database = "sach123", user = "root", passwd = "Sachin@123")
cur = conn.cursor()

#### Get all reecord

In [61]:
query = "SELECT * FROM StudentDetails"
cur.execute(query)

In [62]:
res = cur.fetchall()

In [63]:
res

[(101, 'Sachin', 'Kumar', datetime.date(1995, 10, 24), 'BE', 'IT'),
 (102, 'Nitin', 'Patil', datetime.date(1993, 12, 15), 'TE', 'Comps'),
 (103, 'Harshal', 'Singh', datetime.date(1994, 6, 18), 'SE', 'EXTC'),
 (104, 'Pooja', 'Sinha', datetime.date(1993, 8, 19), 'FE', 'Civil')]

In [64]:
for i in res:
    print(i)

(101, 'Sachin', 'Kumar', datetime.date(1995, 10, 24), 'BE', 'IT')
(102, 'Nitin', 'Patil', datetime.date(1993, 12, 15), 'TE', 'Comps')
(103, 'Harshal', 'Singh', datetime.date(1994, 6, 18), 'SE', 'EXTC')
(104, 'Pooja', 'Sinha', datetime.date(1993, 8, 19), 'FE', 'Civil')

#### Fetch only first 2 columns

In [83]:
query = "SELECT Sid,FirstName FROM StudentDetails"
cur.execute(query)
cur.fetchall()

[(101, 'Sachin'), (102, 'Nitin'), (103, 'Harshal'), (104, 'Pooja')]

### Easy way to See Records from Database using Pandas Library

In [ ]:
import pandas as pd

In [85]:
pd.read_sql("select * from sach123.StudentDetails",conn)

   Sid FirstName LastName RegistrationDate Class Section
0  101    Sachin    Kumar       1995-10-24    BE      IT
1  102     Nitin    Patil       1993-12-15    TE   Comps
2  103   Harshal    Singh       1994-06-18    SE    EXTC
3  104     Pooja    Sinha       1993-08-19    FE   Civil

In [86]:
pd.read_sql("select Sid, FirstName from sach123.StudentDetails",conn)

   Sid FirstName
0  101    Sachin
1  102     Nitin
2  103   Harshal
3  104     Pooja

In [87]:
pd.read_sql("select Sid, Sid from sach123.StudentDetails",conn)

   Sid  Sid
0  101  101
1  102  102
2  103  103
3  104  104

#### How to store table data in csv file

In [14]:
result = pd.read_sql("select FirstName, LastName from sach123.StudentDetails",conn)

In [15]:
result

  FirstName LastName
0    Sachin    Kumar
1     Nitin    Patil
2   Harshal    Singh
3     Pooja    Sinha

In [16]:
result.to_csv("Stud_Details.csv")

In [17]:
conn.close()

### How to store file data into sql

In [19]:
import mysql.connector as connection
con = connection.connect(host = "localhost", database = "sach123", user = "root", passwd = "Sachin@123")
cur = con.cursor()

In [3]:
cur.execute("create table stud_rec(c1 int(10), c2 varchar(20), c3 varchar(20))")

In [23]:
import csv

with open('Stud_Details.csv','r') as data:
    data_csv = csv.reader(data, delimiter = "\n")
    
    for i in data_csv:
        print(i)

[',FirstName,LastName']
['0,Sachin,Kumar']
['1,Nitin,Patil']
['2,Harshal,Singh']
['3,Pooja,Sinha']

In [27]:
with open('Stud_Details.csv','r') as data:
    data_csv = csv.reader(data, delimiter = "\n")
    
    for i in enumerate(data_csv):
        print(i)

(0, [',FirstName,LastName'])
(1, ['0,Sachin,Kumar'])
(2, ['1,Nitin,Patil'])
(3, ['2,Harshal,Singh'])
(4, ['3,Pooja,Sinha'])

In [79]:
import mysql.connector as connection
con = connection.connect(host = "localhost", user = "root", passwd = "Sachin@123")
cur = con.cursor()

with open('Stud_Details.csv','r') as data:
    next(data)
    data_csv = csv.reader(data, delimiter = "\n")
    print(data_csv)
    for i in enumerate(data_csv):
        print(i)
        
        for j in i[1]:
            l = j.split(sep = ",")
            cur.execute('insert into sach123.stud_rec values ({c1},"{c2}","{c3}")'.format(c1=(l[0]), c2=str(l[1]), c3=str(l[2])))
    print("All Record inserted")
con.commit()

<_csv.reader object at 0x000000F57B239D00>
(0, ['0,Sachin,Kumar'])
(1, ['1,Nitin,Patil'])
(2, ['2,Harshal,Singh'])
(3, ['3,Pooja,Sinha'])
All Record inserted

### Delete Data From Database

In [8]:
import mysql.connector as connection

con = connection.connect(host = "localhost", database = "sach123", user = "root", passwd = "Sachin@123", use_pure = True)
cur = con.cursor()

query = "DELETE FROM stud_rec WHERE c1 = 2;"       
cur.execute(query)
con.commit()

for result in cur.fetchall():
    print(result)
    
con.close()

#### To check above mentioned row is deleted or not

In [9]:
con = connection.connect(host = "localhost", database = "sach123", user = "root", passwd = "Sachin@123", use_pure = True)
cur = con.cursor()

query = "SELECT * FROM stud_rec"       
cur.execute(query)

for result in cur.fetchall():
    print(result)
    
con.close()

(0, 'Sachin', 'Kumar')
(1, 'Nitin', 'Patil')
(3, 'Pooja', 'Sinha')

### Update Table

In [11]:
con = connection.connect(host = "localhost", database = "sach123", user = "root", passwd = "Sachin@123", use_pure = True)
cur = con.cursor()

query = "UPDATE stud_rec SET c2 = 'Rahul', c3 = 'Dravid' WHERE c1 = 1"       
cur.execute(query)
con.commit()

for result in cur.fetchall():
    print(result)
    
con.close()

#### To check above mentioned row is updated or not

In [12]:
con = connection.connect(host = "localhost", database = "sach123", user = "root", passwd = "Sachin@123", use_pure = True)
cur = con.cursor()

query = "SELECT * FROM stud_rec"       
cur.execute(query)

for result in cur.fetchall():
    print(result)
    
con.close()

(0, 'Sachin', 'Kumar')
(1, 'Rahul', 'Dravid')
(3, 'Pooja', 'Sinha')